tap "achannarasappa/tap"
tap "mhaeuser/mhaeuser"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "autoconf-archive"
brew "automake"
brew "bat"
brew "btop"
brew "colima", restart_service: :changed
brew "docker"
brew "docker-compose"
brew "eza"
brew "fastfetch"
brew "sdl2"
brew "ffmpeg"
brew "fftw"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "iniparser"
brew "lazygit"
brew "libtool"
brew "libusb"
brew "mas"
brew "neovim"
brew "newsboat"
brew "node"
brew "nvm"
brew "p7zip"
brew "pkgconf"
brew "platformio"
brew "pnpm"
brew "portaudio"
brew "postgresql@14", restart_service: :changed
brew "starship"
brew "thefuck"
brew "tmux"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "oven-sh/bun/bun"
cask "aerospace"
cask "appcleaner"
cask "arc"
cask "balenaetcher"
cask "battery-toolkit"
cask "betterdisplay"
cask "figma"
cask "fliqlo"
cask "font-lora"
cask "font-monaspace"
cask "ghostty"
cask "git-credential-manager"
cask "github"
cask "google-drive"
cask "handbrake-app"
cask "iina"
cask "keycastr"
cask "kicad"
cask "legcord"
cask "marta"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "obsidian"
cask "orcaslicer"
cask "shottr"
cask "transmission"
cask "typora"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "zed"
mas "AdGuard for Safari", id: 1440147259
mas "Amperfy", id: 1530145038
mas "Fonts Ninja", id: 1480227114
mas "Notability", id: 360593530
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 310633997
vscode "anthropic.claude-code"
vscode "melishev.feather-vscode"
vscode "miguelsolorio.fluent-icons"
vscode "ms-vscode.cpptools"
vscode "mvllow.rose-pine"
vscode "platformio.platformio-ide"
vscode "pnp.polacode"
vscode "unifiedjs.vscode-mdx"
vscode "willumz.generic-pseudocode"
vscode "xyc.vscode-mdx-preview"
vscode "zhuangtongfa.material-theme"
